#### Terraform Format and Style `success`
#### Terraform Initialization `success`
#### Terraform Validation `success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```

module.test.data.google_project.project: Reading...
module.test.data.google_project.project: Read complete after 0s [id=projects/cq-provider-gcp]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.test.google_cloud_run_service.default will be created
  + resource "google_cloud_run_service" "default" {
      + autogenerate_revision_name = true
      + id                         = (known after apply)
      + location                   = "us-central1"
      + name                       = "cq-cloudrun-srv"
      + project                    = (known after apply)
      + status                     = (known after apply)

      + metadata {
          + annotations      = {
              + "generated-by"               = "magic-modules"
              + "run.googleapis.com/ingress" = "internal"
            }
          + generation       = (known after apply)
          + labels           = {
              + "key" = "value"
            }
          + namespace        = (known after apply)
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + template {
          + metadata {
              + annotations      = {
                  + "autoscaling.knative.dev/maxScale" = "1"
                  + "run.googleapis.com/client-name"   = "terraform"
                }
              + generation       = (known after apply)
              + labels           = {
                  + "key" = "value"
                }
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
            }

          + spec {
              + container_concurrency = (known after apply)
              + service_account_name  = (known after apply)
              + serving_state         = (known after apply)
              + timeout_seconds       = (known after apply)

              + containers {
                  + command = [
                      + "/server",
                    ]
                  + image   = "us-docker.pkg.dev/cloudrun/container/hello"

                  + env {
                      + name  = "ENV_VAR"
                      + value = "test"
                    }
                  + env {
                      + name = "SECRET_ENV_VAR"

                      + value_from {
                          + secret_key_ref {
                              + key  = "1"
                              + name = "cq-cloudrun-secret"
                            }
                        }
                    }

                  + ports {
                      + container_port = (known after apply)
                      + name           = (known after apply)
                      + protocol       = (known after apply)
                    }

                  + resources {
                      + limits = {
                          + "cpu"    = "1000m"
                          + "memory" = "512Mi"
                        }
                    }

                  + volume_mounts {
                      + mount_path = "/secrets"
                      + name       = "a-volume"
                    }
                }

              + volumes {
                  + name = "a-volume"

                  + secret {
                      + default_mode = 292
                      + secret_name  = "cq-cloudrun-secret"

                      + items {
                          + key  = "1"
                          + mode = 256
                          + path = "my-secret"
                        }
                    }
                }
            }
        }

      + traffic {
          + latest_revision = true
          + percent         = 100
        }
    }

  # module.test.google_secret_manager_secret.secret will be created
  + resource "google_secret_manager_secret" "secret" {
      + create_time = (known after apply)
      + expire_time = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + project     = (known after apply)
      + secret_id   = "cq-cloudrun-secret"

      + replication {
          + automatic = true
        }
    }

  # module.test.google_secret_manager_secret_iam_member.secret-access will be created
  + resource "google_secret_manager_secret_iam_member" "secret-access" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = "serviceAccount:163549298763-compute@developer.gserviceaccount.com"
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = (known after apply)
    }

  # module.test.google_secret_manager_secret_version.secret-version-data will be created
  + resource "google_secret_manager_secret_version" "secret-version-data" {
      + create_time  = (known after apply)
      + destroy_time = (known after apply)
      + enabled      = true
      + id           = (known after apply)
      + name         = (known after apply)
      + secret       = (known after apply)
      + secret_data  = (sensitive value)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.binary

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.binary"

```

</details>

*Pusher: @hermanschaaf, Action: `pull_request_target`, Working Directory: ``, Workflow: `terraform_plan`*